{
    "verses": [
        {
            "id": 1,
            "type": "quran",
            "en": "Successful indeed are the believers who are humble in their prayers.",
            "tr": "Namazlarında huşu içinde olan müminler gerçekten kurtuluşa ermiştir.",
            "surahEn": "Al-Mu'minun",
            "surahTr": "Mü'minûn",
            "ayah": "1-2",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sungguh beruntung orang-orang yang beriman, yang khusyuk dalam salatnya.",
            "ms": "Sesungguhnya berjayalah orang-orang yang beriman, yang khusyuk dalam solatnya.",
            "surahInd": "Al-Mu'minun",
            "surahMs": "Al-Mu'minun",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 2,
            "type": "quran",
            "en": "Establish prayer for My remembrance.",
            "tr": "Beni anmak için namaz kıl.",
            "surahEn": "Ta-Ha",
            "surahTr": "Tâ-Hâ",
            "ayah": "14",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dirikanlah salat, karena sesungguhnya salat itu mencegah dari perbuatan keji dan mungkar.",
            "ms": "Dirikanlah solat, kerana sesungguhnya solat itu mencegah daripada perbuatan keji dan mungkar.",
            "surahInd": "Al-Ankabut",
            "surahMs": "Al-Ankabut",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 3,
            "type": "hadith",
            "en": "The first matter the servant will be asked about on the Day of Judgment is prayer. If it is sound, all his deeds will be sound.",
            "tr": "Kıyamet gününde kulun hesaba çekileceği ilk şey namazdır. Namaz düzgünse diğer ameller de düzgün olur.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Tabarani",
            "sourceTr": "Taberânî",
            "ind": "Perkara pertama yang akan dihisab dari seorang hamba pada Hari Kiamat adalah salat. Jika salatnya baik, maka baiklah seluruh amalnya.",
            "ms": "Perkara pertama yang akan dihisab daripada seorang hamba pada Hari Kiamat ialah solat. Jika solatnya baik, maka baiklah seluruh amalannya.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Tabarani",
            "sourceMs": "Tabarani"
        },
        {
            "id": 4,
            "type": "quran",
            "en": "Verily, in the remembrance of Allah do hearts find rest.",
            "tr": "Bilin ki kalpler ancak Allah'ı anmakla huzura kavuşur.",
            "surahEn": "Ar-Ra'd",
            "surahTr": "Ra'd",
            "ayah": "28",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sesungguhnya salat itu telah ditetapkan atas orang-orang yang beriman pada waktu-waktu yang telah ditentukan.",
            "ms": "Sesungguhnya solat itu telah ditetapkan atas orang-orang yang beriman pada waktu-waktu yang telah ditentukan.",
            "surahInd": "An-Nisa",
            "surahMs": "An-Nisa",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 5,
            "type": "quran",
            "en": "And when My servants ask you about Me, I am near. I respond to the call of the caller when he calls upon Me.",
            "tr": "Kullarım Beni sana sorarsa, Ben yakınım. Bana dua edene dua ettiğinde karşılık veririm.",
            "surahEn": "Al-Baqarah",
            "surahTr": "Bakara",
            "ayah": "186",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Perjanjian antara kita dan mereka adalah salat. Barangsiapa yang meninggalkannya, maka sungguh ia telah kafir.",
            "ms": "Perjanjian antara kita dan mereka ialah solat. Sesiapa yang meninggalkannya, maka sesungguhnya dia telah kafir.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 6,
            "type": "hadith",
            "en": "The closest a servant is to his Lord is when he is in prostration, so increase your supplications therein.",
            "tr": "Kulun Rabbine en yakın olduğu an secdededir. O hâlde secdede duayı çok yapın.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Sahih Muslim",
            "sourceTr": "Müslim",
            "ind": "Dan dirikanlah salat dan tunaikanlah zakat serta rukuklah bersama orang-orang yang rukuk.",
            "ms": "Dan dirikanlah solat dan tunaikanlah zakat serta rukuklah bersama orang-orang yang rukuk.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 7,
            "type": "quran",
            "en": "So remember Me; I will remember you. Be grateful to Me and do not deny Me.",
            "tr": "Öyleyse Beni anın ki Ben de sizi anayım. Bana şükredin, nankörlük etmeyin.",
            "surahEn": "Al-Baqarah",
            "surahTr": "Bakara",
            "ayah": "152",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sampaikan dariku walau satu ayat.",
            "ms": "Sampaikanlah daripadaku walau satu ayat.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 8,
            "type": "quran",
            "en": "Seek help through patience and prayer. Indeed, Allah is with the patient.",
            "tr": "Sabır ve namazla yardım isteyin. Şüphesiz Allah sabredenlerle beraberdir.",
            "surahEn": "Al-Baqarah",
            "surahTr": "Bakara",
            "ayah": "153",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Bacalah Al-Qur'an, karena sesungguhnya ia akan datang pada Hari Kiamat sebagai pemberi syafaat bagi para pembacanya.",
            "ms": "Bacalah Al-Quran, kerana sesungguhnya ia akan datang pada Hari Kiamat sebagai pemberi syafaat bagi para pembacanya.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 9,
            "type": "quran",
            "en": "Indeed, prayer prohibits immorality and wrongdoing, and the remembrance of Allah is greater.",
            "tr": "Şüphesiz namaz, hayâsızlıktan ve kötülükten alıkoyar. Allah'ı anmak elbette en büyük ibadettir.",
            "surahEn": "Al-'Ankabut",
            "surahTr": "Ankebût",
            "ayah": "45",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Ingatlah, hanya dengan mengingat Allah hati menjadi tenteram.",
            "ms": "Ketahuilah, hanya dengan mengingati Allah hati menjadi tenteram.",
            "surahInd": "Ar-Ra'd",
            "surahMs": "Ar-Ra'd",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 10,
            "type": "hadith",
            "en": "Between a man and disbelief is the abandonment of prayer.",
            "tr": "Kişi ile küfür arasında namazın terki vardır.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Sahih Muslim",
            "sourceTr": "Müslim",
            "ind": "Sebaik-baik kamu adalah yang mempelajari Al-Qur'an dan mengajarkannya.",
            "ms": "Sebaik-baik kamu ialah yang mempelajari Al-Quran dan mengajarkannya.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Shahih Bukhari",
            "sourceMs": "Sahih Bukhari"
        },
        {
            "id": 11,
            "type": "quran",
            "en": "My Lord, make me an establisher of prayer, and from my descendants. Our Lord, accept my supplication.",
            "tr": "Rabbim, beni ve soyumdan gelecekleri namazı dosdoğru kılanlardan eyle. Rabbimiz, duamı kabul et.",
            "surahEn": "Ibrahim",
            "surahTr": "İbrâhim",
            "ayah": "40-41",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan apabila hamba-hamba-Ku bertanya kepadamu tentang Aku, maka sesungguhnya Aku dekat. Aku mengabulkan permohonan orang yang berdoa apabila ia berdoa kepada-Ku.",
            "ms": "Dan apabila hamba-hamba-Ku bertanya kepadamu tentang Aku, maka sesungguhnya Aku dekat. Aku memperkenankan permohonan orang yang berdoa apabila dia berdoa kepada-Ku.",
            "surahInd": "Al-Baqarah",
            "surahMs": "Al-Baqarah",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 12,
            "type": "quran",
            "en": "Your Lord has not forsaken you, nor has He become displeased with you.",
            "tr": "Rabbin seni terk etmedi ve sana darılmadı.",
            "surahEn": "Ad-Duhaa",
            "surahTr": "Duhâ",
            "ayah": "3",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Barangsiapa yang menempuh jalan untuk mencari ilmu, maka Allah akan memudahkan baginya jalan menuju surga.",
            "ms": "Sesiapa yang menempuh jalan untuk mencari ilmu, maka Allah akan memudahkan baginya jalan menuju syurga.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 13,
            "type": "hadith",
            "en": "The most beloved of deeds to Allah are those done consistently, even if they are small.",
            "tr": "Allah'a en sevimli ameller, az da olsa devamlı yapılanlardır.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Bukhari & Muslim",
            "sourceTr": "Buhârî & Müslim",
            "ind": "Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya.",
            "ms": "Allah tidak membebankan seseorang melainkan sesuai dengan kesanggupannya.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 14,
            "type": "quran",
            "en": "Say: O My servants who have wronged themselves, do not despair of Allah's mercy. Indeed, Allah forgives all sins.",
            "tr": "De ki: Ey kendilerine kötülük etmiş kullarım! Allah'ın rahmetinden ümit kesmeyin. Allah bütün günahları bağışlar.",
            "surahEn": "Az-Zumar",
            "surahTr": "Zümer",
            "ayah": "53",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Orang yang paling dicintai Allah adalah yang paling bermanfaat bagi orang lain.",
            "ms": "Orang yang paling dicintai Allah ialah yang paling bermanfaat bagi orang lain.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 15,
            "type": "quran",
            "en": "Allah does not burden a soul beyond that it can bear.",
            "tr": "Allah hiçbir nefse taşıyabileceğinden fazlasını yüklemez.",
            "surahEn": "Al-Baqarah",
            "surahTr": "Bakara",
            "ayah": "286",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sesungguhnya sesudah kesulitan itu ada kemudahan.",
            "ms": "Sesungguhnya sesudah kesukaran itu ada kemudahan.",
            "surahInd": "Asy-Syarh",
            "surahMs": "Asy-Syarh",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 16,
            "type": "quran",
            "en": "For indeed, with hardship comes ease. Indeed, with hardship comes ease.",
            "tr": "Şüphesiz zorlukla beraber bir kolaylık vardır. Gerçekten zorlukla beraber bir kolaylık vardır.",
            "surahEn": "Ash-Sharh",
            "surahTr": "İnşirah",
            "ayah": "5-6",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Senyummu di hadapan saudaramu adalah sedekah.",
            "ms": "Senyumanmu di hadapan saudaramu adalah sedekah.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 17,
            "type": "hadith",
            "en": "Actions are judged by intentions, and every person will have what they intended.",
            "tr": "Ameller niyetlere göredir ve herkes niyet ettiğini elde eder.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Bukhari & Muslim",
            "sourceTr": "Buhârî & Müslim",
            "ind": "Dan barangsiapa yang bertawakal kepada Allah, niscaya Allah akan mencukupkan keperluannya.",
            "ms": "Dan sesiapa yang bertawakal kepada Allah, nescaya Allah akan mencukupkan keperluannya.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 18,
            "type": "quran",
            "en": "And whoever puts their trust in Allah, He will be enough for them.",
            "tr": "Kim Allah'a tevekkül ederse, O ona yeter.",
            "surahEn": "At-Talaq",
            "surahTr": "Talâk",
            "ayah": "3",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Tidaklah seorang muslim menanam suatu pohon atau tanaman, lalu ada burung, manusia, atau binatang yang makan darinya, melainkan itu menjadi sedekah baginya.",
            "ms": "Tidaklah seorang muslim menanam suatu pokok atau tanaman, lalu ada burung, manusia, atau binatang yang makan daripadanya, melainkan itu menjadi sedekah baginya.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 19,
            "type": "quran",
            "en": "Call upon Me; I will respond to you.",
            "tr": "Bana dua edin, size karşılık vereyim.",
            "surahEn": "Ghafir",
            "surahTr": "Mü'min",
            "ayah": "60",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sesungguhnya Allah tidak melihat pada bentuk tubuh dan rupa kamu, tetapi Dia melihat pada hati dan amalmu.",
            "ms": "Sesungguhnya Allah tidak melihat pada bentuk tubuh dan rupa kamu, tetapi Dia melihat pada hati dan amalan kamu.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 20,
            "type": "hadith",
            "en": "Prayer is light, charity is proof, and patience is illumination.",
            "tr": "Namaz nurdur, sadaka delildir, sabır ise aydınlıktır.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Sahih Muslim",
            "sourceTr": "Müslim",
            "ind": "Maka ingatlah kepada-Ku, niscaya Aku akan mengingat kamu.",
            "ms": "Maka ingatlah kepada-Ku, nescaya Aku akan mengingati kamu.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 21,
            "type": "quran",
            "en": "And be patient, for indeed, Allah does not allow to be lost the reward of those who do good.",
            "tr": "Sabret, çünkü Allah güzel davrananların mükâfatını zayi etmez.",
            "surahEn": "Hud",
            "surahTr": "Hûd",
            "ayah": "115",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Jagalah Allah, niscaya Dia akan menjagamu.",
            "ms": "Jagalah Allah, nescaya Dia akan menjagamu.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 22,
            "type": "quran",
            "en": "Seek help through patience and prayer. Indeed, it is difficult except for the humbly submissive.",
            "tr": "Sabır ve namazla yardım isteyin. Şüphesiz bu, huşu sahiplerinden başkasına ağır gelir.",
            "surahEn": "Al-Baqarah",
            "surahTr": "Bakara",
            "ayah": "45",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sesungguhnya Allah menyukai apabila salah seorang dari kamu mengerjakan suatu pekerjaan dengan tekun.",
            "ms": "Sesungguhnya Allah menyukai apabila salah seorang daripada kamu mengerjakan sesuatu pekerjaan dengan tekun.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 23,
            "type": "hadith",
            "en": "Whoever prays the two cool prayers will enter Paradise.",
            "tr": "Kim iki serin vaktin namazını kılarsa cennete girer.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Bukhari & Muslim",
            "sourceTr": "Buhârî & Müslim",
            "ind": "Hai orang-orang yang beriman, mintalah pertolongan dengan sabar dan salat.",
            "ms": "Wahai orang-orang yang beriman, mintalah pertolongan dengan sabar dan solat.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 24,
            "type": "quran",
            "en": "Establish prayer at the decline of the sun until the darkness of the night, and the Quran at dawn. Indeed, the recitation of dawn is witnessed.",
            "tr": "Güneşin batıya kaymasından gecenin kararmasına kadar namazı kıl. Bir de sabah namazını. Çünkü sabah namazı şahitlidir.",
            "surahEn": "Al-Isra",
            "surahTr": "İsrâ",
            "ayah": "78",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dunia ini penjara bagi orang mukmin dan surga bagi orang kafir.",
            "ms": "Dunia ini penjara bagi orang mukmin dan syurga bagi orang kafir.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 25,
            "type": "quran",
            "en": "And from part of the night, pray as additional worship. It may be that your Lord will raise you to a praised station.",
            "tr": "Gecenin bir kısmında uyanıp sana mahsus nafile bir ibadet olarak namaz kıl. Rabbinin seni övülmüş bir makama ulaştırması umulur.",
            "surahEn": "Al-Isra",
            "surahTr": "İsrâ",
            "ayah": "79",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan sesungguhnya jika kamu bersyukur, niscaya Aku akan menambah nikmat kepadamu.",
            "ms": "Dan sesungguhnya jika kamu bersyukur, nescaya Aku akan menambah nikmat kepada kamu.",
            "surahInd": "Ibrahim",
            "surahMs": "Ibrahim",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 26,
            "type": "quran",
            "en": "And enjoin prayer upon your family and be steadfast in it. We ask you not for provision; We provide for you.",
            "tr": "Ailene namazı emret ve kendin de ona devam et. Senden rızık istemiyoruz; seni Biz rızıklandırıyoruz.",
            "surahEn": "Ta-Ha",
            "surahTr": "Tâ-Hâ",
            "ayah": "132",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sesungguhnya Allah tidak akan mengubah keadaan suatu kaum sebelum mereka mengubah keadaan diri mereka sendiri.",
            "ms": "Sesungguhnya Allah tidak akan mengubah keadaan sesuatu kaum sebelum mereka mengubah keadaan diri mereka sendiri.",
            "surahInd": "Ar-Ra'd",
            "surahMs": "Ar-Ra'd",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 27,
            "type": "hadith",
            "en": "Make things easy and do not make them difficult. Give glad tidings and do not drive people away.",
            "tr": "Kolaylaştırın, zorlaştırmayın. Müjdeleyin, nefret ettirmeyin.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Bukhari & Muslim",
            "sourceTr": "Buhârî & Müslim",
            "ind": "Sebaik-baik manusia adalah yang paling bermanfaat bagi manusia.",
            "ms": "Sebaik-baik manusia ialah yang paling bermanfaat bagi manusia.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Daraqutni",
            "sourceMs": "Daraqutni"
        },
        {
            "id": 28,
            "type": "quran",
            "en": "Except for those who pray, those who are constant in their prayer.",
            "tr": "Ancak namaz kılanlar müstesna. Onlar namazlarına devam edenlerdir.",
            "surahEn": "Al-Ma'arij",
            "surahTr": "Meâric",
            "ayah": "22-23",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sesungguhnya orang-orang yang selalu memelihara salat, yang mereka tetap menjaga salatnya.",
            "ms": "Sesungguhnya orang-orang yang selalu memelihara solat, yang mereka tetap menjaga solatnya.",
            "surahInd": "Al-Ma'arij",
            "surahMs": "Al-Ma'arij",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 29,
            "type": "quran",
            "en": "The believers are only those who, when Allah is mentioned, their hearts tremble.",
            "tr": "Müminler ancak o kimselerdir ki Allah anıldığında kalpleri ürperir.",
            "surahEn": "Al-Anfal",
            "surahTr": "Enfâl",
            "ayah": "2",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Orang-orang beriman hanyalah mereka yang apabila disebut nama Allah, hati mereka gemetar.",
            "ms": "Orang-orang beriman hanyalah mereka yang apabila disebut nama Allah, hati mereka bergetar.",
            "surahInd": "Al-Anfal",
            "surahMs": "Al-Anfal",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 30,
            "type": "hadith",
            "en": "Allah says: I am as My servant expects Me to be, and I am with him when he remembers Me.",
            "tr": "Allah buyurur: Ben kulumun Beni zannettiği gibiyim. O Beni andığında onunla beraberim.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Bukhari & Muslim",
            "sourceTr": "Buhârî & Müslim",
            "ind": "Allah berfirman: Aku sesuai dengan prasangka hamba-Ku kepada-Ku, dan Aku bersamanya ketika ia mengingat-Ku.",
            "ms": "Allah berfirman: Aku sesuai dengan sangkaan hamba-Ku kepada-Ku, dan Aku bersamanya ketika dia mengingati-Ku.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Bukhari & Muslim",
            "sourceMs": "Bukhari & Muslim"
        },
        {
            "id": 31,
            "type": "quran",
            "en": "And remember your Lord within yourself in humility and in fear, and without loudness in words, in the mornings and the evenings.",
            "tr": "Rabbini, içinden yalvararak ve korkarak, yüksek olmayan bir sesle sabah akşam an.",
            "surahEn": "Al-A'raf",
            "surahTr": "A'râf",
            "ayah": "205",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan ingatlah Tuhanmu dalam hatimu dengan merendahkan diri dan rasa takut, tanpa mengeraskan suara, di waktu pagi dan petang.",
            "ms": "Dan ingatlah Tuhanmu dalam hatimu dengan merendahkan diri dan rasa takut, tanpa mengeraskan suara, di waktu pagi dan petang.",
            "surahInd": "Al-A'raf",
            "surahMs": "Al-A'raf",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 32,
            "type": "quran",
            "en": "O you who believe, remember Allah with much remembrance and glorify Him morning and afternoon.",
            "tr": "Ey iman edenler! Allah'ı çokça zikredin ve O'nu sabah akşam tesbih edin.",
            "surahEn": "Al-Ahzab",
            "surahTr": "Ahzâb",
            "ayah": "41-42",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Wahai orang-orang yang beriman, ingatlah Allah dengan banyak mengingat-Nya dan bertasbihlah kepada-Nya pagi dan petang.",
            "ms": "Wahai orang-orang yang beriman, ingatlah Allah dengan banyak mengingati-Nya dan bertasbihlah kepada-Nya pagi dan petang.",
            "surahInd": "Al-Ahzab",
            "surahMs": "Al-Ahzab",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 33,
            "type": "hadith",
            "en": "The five daily prayers and Friday to Friday expiate whatever sins come between them, as long as major sins are avoided.",
            "tr": "Beş vakit namaz ve bir cuma diğer cumaya, büyük günahlardan kaçınıldığı sürece aralarındaki günahlara kefarettir.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Sahih Muslim",
            "sourceTr": "Müslim",
            "ind": "Salat lima waktu dan Jumat ke Jumat menjadi penghapus dosa di antara keduanya, selama dosa-dosa besar dijauhi.",
            "ms": "Solat lima waktu dan Jumaat ke Jumaat menjadi penghapus dosa di antara keduanya, selagi dosa-dosa besar dijauhi.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Shahih Muslim",
            "sourceMs": "Sahih Muslim"
        },
        {
            "id": 34,
            "type": "quran",
            "en": "Our Lord, do not let our hearts deviate after You have guided us, and grant us from Yourself mercy.",
            "tr": "Rabbimiz, bizi hidayete erdirdikten sonra kalplerimizi eğriltme ve bize katından bir rahmet ver.",
            "surahEn": "Aal-E-Imran",
            "surahTr": "Âl-i İmrân",
            "ayah": "8",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Ya Tuhan kami, janganlah Engkau condongkan hati kami setelah Engkau beri petunjuk kepada kami, dan karuniakanlah kepada kami rahmat dari sisi-Mu.",
            "ms": "Ya Tuhan kami, janganlah Engkau pesongkan hati kami setelah Engkau beri petunjuk kepada kami, dan kurniakanlah kepada kami rahmat dari sisi-Mu.",
            "surahInd": "Ali 'Imran",
            "surahMs": "Ali 'Imran",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 35,
            "type": "quran",
            "en": "And when you have decided, then rely upon Allah. Indeed, Allah loves those who rely upon Him.",
            "tr": "Kararını verdiğinde artık Allah'a tevekkül et. Çünkü Allah tevekkül edenleri sever.",
            "surahEn": "Aal-E-Imran",
            "surahTr": "Âl-i İmrân",
            "ayah": "159",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Apabila engkau telah membulatkan tekad, maka bertawakallah kepada Allah. Sesungguhnya Allah mencintai orang-orang yang bertawakal.",
            "ms": "Apabila engkau telah membulatkan tekad, maka bertawakallah kepada Allah. Sesungguhnya Allah mencintai orang-orang yang bertawakal.",
            "surahInd": "Ali 'Imran",
            "surahMs": "Ali 'Imran",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 36,
            "type": "quran",
            "en": "It is He who sent down tranquility into the hearts of the believers that they would increase in faith.",
            "tr": "İmanlarına iman katsınlar diye müminlerin kalplerine huzur indiren O'dur.",
            "surahEn": "Al-Fath",
            "surahTr": "Fetih",
            "ayah": "4",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dialah yang menurunkan ketenangan ke dalam hati orang-orang mukmin agar mereka bertambah iman.",
            "ms": "Dialah yang menurunkan ketenangan ke dalam hati orang-orang mukmin supaya mereka bertambah iman.",
            "surahInd": "Al-Fath",
            "surahMs": "Al-Fath",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 37,
            "type": "hadith",
            "en": "If there was a river at your door and you bathed in it five times a day, would any dirt remain? That is the example of the five prayers.",
            "tr": "Kapınızın önünde bir nehir olsa ve günde beş kez yıkansanız, üzerinizde kir kalır mı? İşte beş vakit namaz böyledir.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Bukhari & Muslim",
            "sourceTr": "Buhârî & Müslim",
            "ind": "Seandainya ada sungai di depan pintu rumah kalian dan kalian mandi lima kali sehari, apakah masih ada kotoran yang tersisa? Itulah perumpamaan salat lima waktu.",
            "ms": "Seandainya ada sungai di hadapan pintu rumah kamu dan kamu mandi lima kali sehari, adakah masih ada kotoran yang tinggal? Itulah perumpamaan solat lima waktu.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Bukhari & Muslim",
            "sourceMs": "Bukhari & Muslim"
        },
        {
            "id": 38,
            "type": "quran",
            "en": "If you are grateful, I will surely increase you; but if you deny, indeed, My punishment is severe.",
            "tr": "Şükrederseniz elbette size nimetimi artırırım. Nankörlük ederseniz, azabım çok şiddetlidir.",
            "surahEn": "Ibrahim",
            "surahTr": "İbrâhim",
            "ayah": "7",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Jika kalian bersyukur, niscaya Aku akan menambah nikmat untuk kalian. Tetapi jika kalian mengingkari, sesungguhnya azab-Ku sangat keras.",
            "ms": "Jika kamu bersyukur, nescaya Aku akan menambah nikmat untuk kamu. Tetapi jika kamu mengingkari, sesungguhnya azab-Ku sangat keras.",
            "surahInd": "Ibrahim",
            "surahMs": "Ibrahim",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 39,
            "type": "quran",
            "en": "Is the reward for good anything but good?",
            "tr": "İyiliğin karşılığı iyilikten başka ne olabilir?",
            "surahEn": "Ar-Rahman",
            "surahTr": "Rahmân",
            "ayah": "60",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Bukankah balasan kebaikan itu kebaikan pula?",
            "ms": "Bukankah balasan kebaikan itu kebaikan juga?",
            "surahInd": "Ar-Rahman",
            "surahMs": "Ar-Rahman",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 40,
            "type": "hadith",
            "en": "When you stand to pray, pray as if it is your farewell prayer.",
            "tr": "Namaza durduğunda, veda namazı kılar gibi kıl.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Ibn Majah",
            "sourceTr": "İbn Mâce",
            "ind": "Apabila engkau berdiri untuk salat, salatlah seolah-olah itu salat perpisahanmu.",
            "ms": "Apabila engkau berdiri untuk solat, solatlah seolah-olah itu solat perpisahanmu.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Ibnu Majah",
            "sourceMs": "Ibn Majah"
        },
        {
            "id": 41,
            "type": "quran",
            "en": "Indeed, prayer has been decreed upon the believers at specified times.",
            "tr": "Şüphesiz namaz, müminlere belirli vakitlerde farz kılınmıştır.",
            "surahEn": "An-Nisa",
            "surahTr": "Nisâ",
            "ayah": "103",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sesungguhnya salat itu telah diwajibkan atas orang-orang beriman pada waktu-waktu yang telah ditentukan.",
            "ms": "Sesungguhnya solat itu telah diwajibkan atas orang-orang beriman pada waktu-waktu yang telah ditentukan.",
            "surahInd": "An-Nisa",
            "surahMs": "An-Nisa",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 42,
            "type": "quran",
            "en": "O you who believe, turn to Allah with sincere repentance.",
            "tr": "Ey iman edenler! Allah'a içten bir tövbe ile dönün.",
            "surahEn": "At-Tahrim",
            "surahTr": "Tahrîm",
            "ayah": "8",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Wahai orang-orang yang beriman, bertobatlah kepada Allah dengan tobat yang sungguh-sungguh.",
            "ms": "Wahai orang-orang yang beriman, bertaubatlah kepada Allah dengan taubat yang sungguh-sungguh.",
            "surahInd": "At-Tahrim",
            "surahMs": "At-Tahrim",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 43,
            "type": "hadith",
            "en": "Wondrous is the affair of the believer. All of it is good for him, and that is for no one except the believer.",
            "tr": "Müminin durumu ne güzeldir! Her hâli onun için hayırdır. Bu yalnızca mümine mahsustur.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Sahih Muslim",
            "sourceTr": "Müslim",
            "ind": "Sungguh menakjubkan keadaan seorang mukmin. Semua keadaannya baik baginya, dan itu hanya dimiliki oleh seorang mukmin.",
            "ms": "Sungguh menakjubkan keadaan seorang mukmin. Semua keadaannya baik baginya, dan itu hanya dimiliki oleh seorang mukmin.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Shahih Muslim",
            "sourceMs": "Sahih Muslim"
        },
        {
            "id": 44,
            "type": "quran",
            "en": "You alone we worship, and You alone we ask for help. Guide us to the straight path.",
            "tr": "Yalnız Sana ibadet eder, yalnız Senden yardım dileriz. Bizi dosdoğru yola ilet.",
            "surahEn": "Al-Fatihah",
            "surahTr": "Fâtiha",
            "ayah": "5-6",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Hanya kepada-Mu kami menyembah dan hanya kepada-Mu kami memohon pertolongan. Tunjukilah kami jalan yang lurus.",
            "ms": "Hanya kepada-Mu kami menyembah dan hanya kepada-Mu kami memohon pertolongan. Tunjukkanlah kami jalan yang lurus.",
            "surahInd": "Al-Fatihah",
            "surahMs": "Al-Fatihah",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 45,
            "type": "quran",
            "en": "And do not be like those who forgot Allah, so He made them forget themselves.",
            "tr": "Allah'ı unutan ve bu yüzden Allah'ın da kendilerini unutturduğu kimseler gibi olmayın.",
            "surahEn": "Al-Hashr",
            "surahTr": "Haşr",
            "ayah": "19",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan janganlah kamu seperti orang-orang yang melupakan Allah, lalu Allah menjadikan mereka lupa akan diri mereka sendiri.",
            "ms": "Dan janganlah kamu seperti orang-orang yang melupakan Allah, lalu Allah menjadikan mereka lupa akan diri mereka sendiri.",
            "surahInd": "Al-Hasyr",
            "surahMs": "Al-Hasyr",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 46,
            "type": "quran",
            "en": "We created man, and We know what his soul whispers to him. We are closer to him than his jugular vein.",
            "tr": "İnsanı Biz yarattık ve nefsinin ona ne fısıldadığını biliriz. Biz ona şah damarından daha yakınız.",
            "surahEn": "Qaf",
            "surahTr": "Kâf",
            "ayah": "16",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Kami telah menciptakan manusia dan Kami mengetahui apa yang dibisikkan oleh jiwanya. Kami lebih dekat kepadanya daripada urat lehernya.",
            "ms": "Kami telah menciptakan manusia dan Kami mengetahui apa yang dibisikkan oleh jiwanya. Kami lebih dekat kepadanya daripada urat lehernya.",
            "surahInd": "Qaf",
            "surahMs": "Qaf",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 47,
            "type": "hadith",
            "en": "Allah extends His hand at night to accept the repentance of those who sinned during the day, and extends His hand during the day for those who sinned at night.",
            "tr": "Allah, gündüz günah işleyenin tövbesini kabul etmek için gece elini uzatır; gece günah işleyenin tövbesi için de gündüz elini uzatır.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Sahih Muslim",
            "sourceTr": "Müslim",
            "ind": "Allah membentangkan tangan-Nya di malam hari untuk menerima tobat orang yang berdosa di siang hari, dan membentangkan tangan-Nya di siang hari untuk menerima tobat orang yang berdosa di malam hari.",
            "ms": "Allah menghulurkan tangan-Nya pada waktu malam untuk menerima taubat orang yang berdosa pada siang hari, dan menghulurkan tangan-Nya pada siang hari untuk menerima taubat orang yang berdosa pada waktu malam.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Shahih Muslim",
            "sourceMs": "Sahih Muslim"
        },
        {
            "id": 48,
            "type": "quran",
            "en": "And He is with you wherever you are. And Allah sees what you do.",
            "tr": "Nerede olsanız O sizinle beraberdir. Allah yaptıklarınızı görür.",
            "surahEn": "Al-Hadid",
            "surahTr": "Hadîd",
            "ayah": "4",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan Dia bersama kamu di mana saja kamu berada. Dan Allah Maha Melihat apa yang kamu kerjakan.",
            "ms": "Dan Dia bersama kamu di mana sahaja kamu berada. Dan Allah Maha Melihat apa yang kamu kerjakan.",
            "surahInd": "Al-Hadid",
            "surahMs": "Al-Hadid",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 49,
            "type": "quran",
            "en": "Indeed, those who fear their Lord unseen will have forgiveness and a great reward.",
            "tr": "Görmedikleri hâlde Rablerinden korkanlar için bağışlanma ve büyük mükâfat vardır.",
            "surahEn": "Al-Mulk",
            "surahTr": "Mülk",
            "ayah": "12",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sesungguhnya orang-orang yang takut kepada Tuhannya yang tidak terlihat, mereka akan memperoleh ampunan dan pahala yang besar.",
            "ms": "Sesungguhnya orang-orang yang takut kepada Tuhannya yang tidak kelihatan, mereka akan memperoleh keampunan dan pahala yang besar.",
            "surahInd": "Al-Mulk",
            "surahMs": "Al-Mulk",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 50,
            "type": "hadith",
            "en": "Be mindful of Allah, and He will protect you. Be mindful of Allah, and you will find Him before you.",
            "tr": "Allah'ı gözet ki Allah da seni gözetsin. Allah'ı gözet, O'nu önünde bulursun.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Tirmidhi",
            "sourceTr": "Tirmizî",
            "ind": "Jagalah Allah, niscaya Allah akan menjagamu. Jagalah Allah, niscaya kamu mendapati-Nya di hadapanmu.",
            "ms": "Jagalah Allah, nescaya Allah akan menjagamu. Jagalah Allah, nescaya kamu mendapati-Nya di hadapanmu.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Tirmidzi",
            "sourceMs": "Tirmizi"
        },
        {
            "id": 51,
            "type": "quran",
            "en": "Guard strictly your prayers, especially the middle prayer, and stand before Allah in devout obedience.",
            "tr": "Namazlara, özellikle orta namaza devam edin ve Allah için saygıyla kıyamda durun.",
            "surahEn": "Al-Baqarah",
            "surahTr": "Bakara",
            "ayah": "238",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Peliharalah semua salat dan salat wustha, dan berdirilah untuk Allah dengan penuh kekhusyukan.",
            "ms": "Peliharalah semua solat dan solat wustha, dan berdirilah untuk Allah dengan penuh kekhusyukan.",
            "surahInd": "Al-Baqarah",
            "surahMs": "Al-Baqarah",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 52,
            "type": "quran",
            "en": "I did not create the jinn and mankind except to worship Me.",
            "tr": "Ben cinleri ve insanları ancak Bana kulluk etsinler diye yarattım.",
            "surahEn": "Adh-Dhariyat",
            "surahTr": "Zâriyât",
            "ayah": "56",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Tidaklah Aku ciptakan jin dan manusia kecuali untuk beribadah kepada-Ku.",
            "ms": "Tidaklah Aku ciptakan jin dan manusia kecuali untuk beribadat kepada-Ku.",
            "surahInd": "Adz-Dzariyat",
            "surahMs": "Adz-Dzariyat",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 53,
            "type": "hadith",
            "en": "Prostrate much, for you do not prostrate to Allah once without Him raising you a degree and removing a sin from you.",
            "tr": "Çok secde edin. Çünkü Allah'a bir secde ettiğinizde Allah sizi bir derece yükseltir ve bir günahınızı siler.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Sahih Muslim",
            "sourceTr": "Müslim",
            "ind": "Perbanyaklah sujud, karena tidaklah engkau bersujud kepada Allah sekali pun melainkan Allah mengangkatmu satu derajat dan menghapus satu dosamu.",
            "ms": "Perbanyakkanlah sujud, kerana tidaklah engkau bersujud kepada Allah sekali pun melainkan Allah mengangkatmu satu darjat dan menghapus satu dosamu.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Shahih Muslim",
            "sourceMs": "Sahih Muslim"
        },
        {
            "id": 54,
            "type": "quran",
            "en": "Our Lord, give us good in this world and good in the Hereafter, and protect us from the punishment of the Fire.",
            "tr": "Rabbimiz, bize dünyada iyilik ver, ahirette de iyilik ver ve bizi ateş azabından koru.",
            "surahEn": "Al-Baqarah",
            "surahTr": "Bakara",
            "ayah": "201",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Ya Tuhan kami, berikanlah kami kebaikan di dunia dan kebaikan di akhirat, dan lindungilah kami dari azab neraka.",
            "ms": "Ya Tuhan kami, berikanlah kami kebaikan di dunia dan kebaikan di akhirat, dan lindungilah kami dari azab neraka.",
            "surahInd": "Al-Baqarah",
            "surahMs": "Al-Baqarah",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 55,
            "type": "quran",
            "en": "Those who remember Allah standing, sitting, and lying on their sides, and reflect on the creation of the heavens and earth.",
            "tr": "Onlar ayakta, oturarak ve yanları üzerine yatarken Allah'ı anarlar; göklerin ve yerin yaratılışı üzerinde düşünürler.",
            "surahEn": "Aal-E-Imran",
            "surahTr": "Âl-i İmrân",
            "ayah": "191",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Orang-orang yang mengingat Allah sambil berdiri, duduk, atau berbaring, dan mereka memikirkan tentang penciptaan langit dan bumi.",
            "ms": "Orang-orang yang mengingati Allah sambil berdiri, duduk, atau berbaring, dan mereka memikirkan tentang penciptaan langit dan bumi.",
            "surahInd": "Ali 'Imran",
            "surahMs": "Ali 'Imran",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 56,
            "type": "quran",
            "en": "Our Lord, grant us from our spouses and offspring comfort to our eyes, and make us leaders for the righteous.",
            "tr": "Rabbimiz, bize eşlerimizden ve çocuklarımızdan göz aydınlığı ver ve bizi takva sahiplerine önder kıl.",
            "surahEn": "Al-Furqan",
            "surahTr": "Furkân",
            "ayah": "74",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Ya Tuhan kami, anugerahkanlah kepada kami pasangan dan keturunan yang menyejukkan hati kami, dan jadikanlah kami pemimpin bagi orang-orang yang bertakwa.",
            "ms": "Ya Tuhan kami, anugerahkanlah kepada kami pasangan dan keturunan yang menyejukkan hati kami, dan jadikanlah kami pemimpin bagi orang-orang yang bertakwa.",
            "surahInd": "Al-Furqan",
            "surahMs": "Al-Furqan",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 57,
            "type": "hadith",
            "en": "The prayer of a man in congregation is twenty-five times greater in reward than his prayer at home or in the marketplace.",
            "tr": "Cemaatle kılınan namaz, evde veya çarşıda kılınan namazdan yirmi beş kat daha faziletlidir.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Bukhari & Muslim",
            "sourceTr": "Buhârî & Müslim",
            "ind": "Salat seseorang secara berjamaah lebih utama dua puluh lima derajat daripada salatnya di rumah atau di pasar.",
            "ms": "Solat seseorang secara berjemaah lebih utama dua puluh lima darjat daripada solatnya di rumah atau di pasar.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Bukhari & Muslim",
            "sourceMs": "Bukhari & Muslim"
        },
        {
            "id": 58,
            "type": "quran",
            "en": "And keep yourself patient with those who call upon their Lord in the morning and evening, seeking His face.",
            "tr": "Sabah akşam Rablerinin rızasını dileyerek O'na dua edenlerle beraber sabret.",
            "surahEn": "Al-Kahf",
            "surahTr": "Kehf",
            "ayah": "28",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan bersabarlah bersama orang-orang yang menyeru Tuhannya di pagi dan petang hari dengan mengharapkan keridhaan-Nya.",
            "ms": "Dan bersabarlah bersama orang-orang yang menyeru Tuhannya pada waktu pagi dan petang dengan mengharapkan keredaan-Nya.",
            "surahInd": "Al-Kahf",
            "surahMs": "Al-Kahf",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 59,
            "type": "quran",
            "en": "O my son, establish prayer, enjoin what is right, forbid what is wrong, and be patient over what befalls you.",
            "tr": "Yavrucuğum, namazı kıl, iyiliği emret, kötülükten sakındır ve başına gelene sabret.",
            "surahEn": "Luqman",
            "surahTr": "Lokmân",
            "ayah": "17",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Wahai anakku, dirikanlah salat, suruhlah yang makruf, cegahlah yang mungkar, dan bersabarlah atas apa yang menimpamu.",
            "ms": "Wahai anakku, dirikanlah solat, suruhlah yang makruf, cegahlah yang mungkar, dan bersabarlah atas apa yang menimpamu.",
            "surahInd": "Luqman",
            "surahMs": "Luqman",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 60,
            "type": "hadith",
            "en": "The angels pray for one of you as long as he remains in his prayer place. They say: O Allah, forgive him. O Allah, have mercy on him.",
            "tr": "Sizden biri namaz kıldığı yerde kaldığı sürece melekler ona dua eder: Allah'ım onu bağışla, Allah'ım ona merhamet et.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Sahih Bukhari",
            "sourceTr": "Buhârî",
            "ind": "Malaikat mendoakan salah seorang di antara kamu selama ia berada di tempat salatnya. Mereka berkata: Ya Allah, ampunilah dia. Ya Allah, rahmatilah dia.",
            "ms": "Malaikat mendoakan salah seorang di antara kamu selagi dia berada di tempat solatnya. Mereka berkata: Ya Allah, ampunilah dia. Ya Allah, rahmatilah dia.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Shahih Bukhari",
            "sourceMs": "Sahih Bukhari"
        },
        {
            "id": 61,
            "type": "quran",
            "en": "O you who believe, bow and prostrate and worship your Lord and do good, that you may succeed.",
            "tr": "Ey iman edenler! Rükû edin, secde edin, Rabbinize kulluk edin ve hayır işleyin ki kurtuluşa eresiniz.",
            "surahEn": "Al-Hajj",
            "surahTr": "Hac",
            "ayah": "77",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Wahai orang-orang yang beriman, rukuklah, sujudlah, dan sembahlah Tuhanmu, serta berbuatlah kebaikan agar kamu beruntung.",
            "ms": "Wahai orang-orang yang beriman, rukuklah, sujudlah, dan sembahlah Tuhanmu, serta berbuatlah kebaikan supaya kamu beruntung.",
            "surahInd": "Al-Hajj",
            "surahMs": "Al-Hajj",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 62,
            "type": "quran",
            "en": "The patient, the true, the obedient, those who spend in the way of Allah, and those who seek forgiveness before dawn.",
            "tr": "Sabredenler, doğru olanlar, itaat edenler, infak edenler ve seher vakitlerinde istiğfar edenler.",
            "surahEn": "Aal-E-Imran",
            "surahTr": "Âl-i İmrân",
            "ayah": "17",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Orang-orang yang sabar, jujur, taat, yang berinfak, dan yang memohon ampun di waktu sahur.",
            "ms": "Orang-orang yang sabar, jujur, taat, yang berinfak, dan yang memohon ampun di waktu sahur.",
            "surahInd": "Ali 'Imran",
            "surahMs": "Ali 'Imran",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 63,
            "type": "hadith",
            "en": "Whoever prays Fajr is under the protection of Allah. So do not fall short in fulfilling Allah's right over you.",
            "tr": "Sabah namazını kılan Allah'ın himayesindedir. Allah'ın hakkını yerine getirmekte kusur etmeyin.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Sahih Muslim",
            "sourceTr": "Müslim",
            "ind": "Barangsiapa yang salat Subuh, maka ia berada dalam jaminan Allah. Maka janganlah kamu lalai dalam memenuhi hak Allah.",
            "ms": "Sesiapa yang solat Subuh, maka dia berada dalam jaminan Allah. Maka janganlah kamu lalai dalam memenuhi hak Allah.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Shahih Muslim",
            "sourceMs": "Sahih Muslim"
        },
        {
            "id": 64,
            "type": "quran",
            "en": "And remember the name of your Lord morning and evening. And during the night prostrate to Him and glorify Him a long part of the night.",
            "tr": "Sabah akşam Rabbinin adını an. Gecenin bir kısmında O'na secde et ve geceleyin uzun uzun O'nu tesbih et.",
            "surahEn": "Al-Insan",
            "surahTr": "İnsân",
            "ayah": "25-26",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan sebutlah nama Tuhanmu pada pagi dan petang hari. Dan pada sebagian malam, sujudlah kepada-Nya dan bertasbihlah kepada-Nya sepanjang malam.",
            "ms": "Dan sebutlah nama Tuhanmu pada waktu pagi dan petang. Dan pada sebahagian malam, sujudlah kepada-Nya dan bertasbihlah kepada-Nya sepanjang malam.",
            "surahInd": "Al-Insan",
            "surahMs": "Al-Insan",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 65,
            "type": "quran",
            "en": "O reassured soul, return to your Lord well-pleased and pleasing to Him. Enter among My righteous servants and enter My Paradise.",
            "tr": "Ey huzura kavuşmuş nefis! Razı olmuş ve razı olunmuş olarak Rabbine dön. Kullarımın arasına katıl ve cennetime gir.",
            "surahEn": "Al-Fajr",
            "surahTr": "Fecr",
            "ayah": "27-30",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Wahai jiwa yang tenang, kembalilah kepada Tuhanmu dengan hati yang ridha dan diridhai. Masuklah ke dalam golongan hamba-hamba-Ku dan masuklah ke dalam surga-Ku.",
            "ms": "Wahai jiwa yang tenang, kembalilah kepada Tuhanmu dengan hati yang redha dan diredhai. Masuklah ke dalam golongan hamba-hamba-Ku dan masuklah ke dalam syurga-Ku.",
            "surahInd": "Al-Fajr",
            "surahMs": "Al-Fajr",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 66,
            "type": "quran",
            "en": "And they were not commanded except to worship Allah, being sincere to Him in religion.",
            "tr": "Hâlbuki onlara ancak dini Allah'a has kılarak O'na kulluk etmeleri emredilmişti.",
            "surahEn": "Al-Bayyinah",
            "surahTr": "Beyyine",
            "ayah": "5",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan tidaklah mereka diperintahkan kecuali agar menyembah Allah dengan mengikhlaskan agama hanya untuk-Nya.",
            "ms": "Dan tidaklah mereka diperintahkan kecuali agar menyembah Allah dengan mengikhlaskan agama hanya untuk-Nya.",
            "surahInd": "Al-Bayyinah",
            "surahMs": "Al-Bayyinah",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 67,
            "type": "hadith",
            "en": "The most burdensome prayers for the hypocrites are the Isha and Fajr prayers. If they knew what reward lies in them, they would come even if crawling.",
            "tr": "Münafıklara en ağır gelen namaz yatsı ve sabah namazıdır. Ondaki sevabı bilselerdi emekleyerek de olsa gelirlerdi.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Bukhari & Muslim",
            "sourceTr": "Buhârî & Müslim",
            "ind": "Salat yang paling berat bagi orang munafik adalah salat Isya dan Subuh. Seandainya mereka mengetahui pahala yang ada di dalamnya, mereka akan mendatanginya meskipun dengan merangkak.",
            "ms": "Solat yang paling berat bagi orang munafik ialah solat Isyak dan Subuh. Seandainya mereka mengetahui pahala yang ada di dalamnya, mereka akan mendatanginya walaupun dengan merangkak.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Bukhari & Muslim",
            "sourceMs": "Bukhari & Muslim"
        },
        {
            "id": 68,
            "type": "quran",
            "en": "So fear Allah as much as you are able, and listen, obey, and spend; it is better for yourselves.",
            "tr": "Gücünüz yettiğince Allah'tan korkun, dinleyin, itaat edin ve infak edin. Bu sizin için daha hayırlıdır.",
            "surahEn": "At-Taghabun",
            "surahTr": "Teğâbun",
            "ayah": "16",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Maka bertakwalah kamu kepada Allah semampu kamu, dengarkanlah, taatlah, dan berinfaklah. Itu lebih baik bagi dirimu.",
            "ms": "Maka bertakwalah kamu kepada Allah semampu kamu, dengarlah, taatlah, dan berinfaklah. Itu lebih baik bagi dirimu.",
            "surahInd": "At-Taghabun",
            "surahMs": "At-Taghabun",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 69,
            "type": "quran",
            "en": "Say: Call upon Allah or call upon the Most Merciful. Whichever name you call, to Him belong the most beautiful names.",
            "tr": "De ki: İster Allah deyin ister Rahman deyin. Hangisini deseniz, en güzel isimler O'nundur.",
            "surahEn": "Al-Isra",
            "surahTr": "İsrâ",
            "ayah": "110",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Katakanlah: Serulah Allah atau serulah Ar-Rahman. Dengan nama yang mana pun kamu menyeru, Dia mempunyai nama-nama yang paling baik.",
            "ms": "Katakanlah: Serulah Allah atau serulah Ar-Rahman. Dengan nama yang mana pun kamu menyeru, Dia mempunyai nama-nama yang paling baik.",
            "surahInd": "Al-Isra",
            "surahMs": "Al-Isra",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 70,
            "type": "hadith",
            "en": "Two rak'ahs of Fajr are better than the world and everything in it.",
            "tr": "Sabah namazının iki rekât sünneti, dünyadan ve dünyadaki her şeyden daha hayırlıdır.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Sahih Muslim",
            "sourceTr": "Müslim",
            "ind": "Dua rakaat salat Subuh lebih baik dari dunia dan seisinya.",
            "ms": "Dua rakaat solat Subuh lebih baik daripada dunia dan seisinya.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Shahih Muslim",
            "sourceMs": "Sahih Muslim"
        },
        {
            "id": 71,
            "type": "quran",
            "en": "There is no god except You; glory be to You. Indeed, I have been of the wrongdoers.",
            "tr": "Senden başka ilah yoktur. Seni tenzih ederim. Gerçekten ben zalimlerden oldum.",
            "surahEn": "Al-Anbiya",
            "surahTr": "Enbiyâ",
            "ayah": "87",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Tidak ada tuhan selain Engkau. Mahasuci Engkau. Sesungguhnya aku termasuk orang-orang yang zalim.",
            "ms": "Tidak ada tuhan selain Engkau. Maha Suci Engkau. Sesungguhnya aku termasuk orang-orang yang zalim.",
            "surahInd": "Al-Anbiya",
            "surahMs": "Al-Anbiya",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 72,
            "type": "quran",
            "en": "My Lord, I am in need of whatever good You would send down to me.",
            "tr": "Rabbim, bana indireceğin her hayra muhtacım.",
            "surahEn": "Al-Qasas",
            "surahTr": "Kasas",
            "ayah": "24",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Ya Tuhanku, sesungguhnya aku sangat memerlukan kebaikan apa pun yang Engkau turunkan kepadaku.",
            "ms": "Ya Tuhanku, sesungguhnya aku sangat memerlukan kebaikan apa pun yang Engkau turunkan kepadaku.",
            "surahInd": "Al-Qasas",
            "surahMs": "Al-Qasas",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 73,
            "type": "hadith",
            "en": "Supplication is worship.",
            "tr": "Dua ibadetin ta kendisidir.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Abu Dawud & Tirmidhi",
            "sourceTr": "Ebû Dâvûd & Tirmizî",
            "ind": "Doa itu adalah ibadah.",
            "ms": "Doa itu adalah ibadat.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Abu Dawud & Tirmidzi",
            "sourceMs": "Abu Daud & Tirmizi"
        },
        {
            "id": 74,
            "type": "quran",
            "en": "Indeed, those who believe and do righteous deeds, the Most Merciful will appoint for them affection.",
            "tr": "İman edip salih amel işleyenler için Rahman, gönüllere bir sevgi koyacaktır.",
            "surahEn": "Maryam",
            "surahTr": "Meryem",
            "ayah": "96",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sesungguhnya orang-orang yang beriman dan beramal saleh, Yang Maha Pengasih akan menanamkan rasa kasih sayang dalam hati mereka.",
            "ms": "Sesungguhnya orang-orang yang beriman dan beramal soleh, Yang Maha Pengasih akan menanamkan rasa kasih sayang dalam hati mereka.",
            "surahInd": "Maryam",
            "surahMs": "Maryam",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 75,
            "type": "quran",
            "en": "So glorify Allah when you reach the evening and when you reach the morning. To Him is all praise in the heavens and earth.",
            "tr": "Akşama ulaştığınızda ve sabaha erdiğinizde Allah'ı tesbih edin. Göklerde ve yerde hamd O'na mahsustur.",
            "surahEn": "Ar-Rum",
            "surahTr": "Rûm",
            "ayah": "17-18",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Maka bertasbihlah kepada Allah ketika kamu memasuki waktu petang dan ketika kamu memasuki waktu pagi. Segala puji bagi-Nya di langit dan di bumi.",
            "ms": "Maka bertasbihlah kepada Allah ketika kamu memasuki waktu petang dan ketika kamu memasuki waktu pagi. Segala puji bagi-Nya di langit dan di bumi.",
            "surahInd": "Ar-Rum",
            "surahMs": "Ar-Rum",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 76,
            "type": "quran",
            "en": "And I entrust my affair to Allah. Indeed, Allah is Seeing of His servants.",
            "tr": "Ben işimi Allah'a havale ediyorum. Şüphesiz Allah kullarını çok iyi görür.",
            "surahEn": "Ghafir",
            "surahTr": "Mü'min",
            "ayah": "44",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan aku menyerahkan urusanku kepada Allah. Sesungguhnya Allah Maha Melihat hamba-hamba-Nya.",
            "ms": "Dan aku menyerahkan urusanku kepada Allah. Sesungguhnya Allah Maha Melihat hamba-hamba-Nya.",
            "surahInd": "Ghafir",
            "surahMs": "Ghafir",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 77,
            "type": "hadith",
            "en": "Nothing is more honorable to Allah than supplication.",
            "tr": "Allah katında duadan daha değerli bir şey yoktur.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Tirmidhi",
            "sourceTr": "Tirmizî",
            "ind": "Tidak ada sesuatu yang lebih mulia di sisi Allah daripada doa.",
            "ms": "Tidak ada sesuatu yang lebih mulia di sisi Allah daripada doa.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Tirmidzi",
            "sourceMs": "Tirmizi"
        },
        {
            "id": 78,
            "type": "quran",
            "en": "I only complain of my suffering and grief to Allah, and I know from Allah that which you do not know.",
            "tr": "Ben üzüntümü ve kederimi yalnızca Allah'a arz ediyorum. Allah'tan sizin bilmediğiniz şeyleri biliyorum.",
            "surahEn": "Yusuf",
            "surahTr": "Yûsuf",
            "ayah": "86",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sesungguhnya aku hanya mengadukan kesedihan dan dukacitaku kepada Allah, dan aku mengetahui dari Allah apa yang tidak kamu ketahui.",
            "ms": "Sesungguhnya aku hanya mengadukan kesedihan dan dukacitaku kepada Allah, dan aku mengetahui dari Allah apa yang kamu tidak ketahui.",
            "surahInd": "Yusuf",
            "surahMs": "Yusuf",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 79,
            "type": "quran",
            "en": "When you have finished the prayer, remember Allah standing, sitting, and lying on your sides.",
            "tr": "Namazı bitirince ayakta, oturarak ve yanlarınız üzerine yatarken Allah'ı anın.",
            "surahEn": "An-Nisa",
            "surahTr": "Nisâ",
            "ayah": "103",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Apabila kamu telah menyelesaikan salat, ingatlah Allah sambil berdiri, duduk, dan berbaring.",
            "ms": "Apabila kamu telah menyelesaikan solat, ingatlah Allah sambil berdiri, duduk, dan berbaring.",
            "surahInd": "An-Nisa",
            "surahMs": "An-Nisa",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 80,
            "type": "hadith",
            "en": "Allah is shy and generous. He is shy when His servant raises his hands to return them empty.",
            "tr": "Allah hayâ sahibi ve cömerttir. Kulu ellerini kaldırdığında onları boş çevirmekten hayâ eder.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Abu Dawud & Tirmidhi",
            "sourceTr": "Ebû Dâvûd & Tirmizî",
            "ind": "Allah itu Maha Pemalu dan Maha Pemurah. Dia malu apabila seorang hamba mengangkat kedua tangannya lalu mengembalikannya dalam keadaan kosong.",
            "ms": "Allah itu Maha Pemalu dan Maha Pemurah. Dia malu apabila seorang hamba mengangkat kedua tangannya lalu mengembalikannya dalam keadaan kosong.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Abu Dawud & Tirmidzi",
            "sourceMs": "Abu Daud & Tirmizi"
        },
        {
            "id": 81,
            "type": "quran",
            "en": "O you who believe, when the call to prayer is made on Friday, hasten to the remembrance of Allah and leave trade.",
            "tr": "Ey iman edenler! Cuma günü namaz için çağrı yapıldığında Allah'ı anmaya koşun ve alışverişi bırakın.",
            "surahEn": "Al-Jumu'ah",
            "surahTr": "Cuma",
            "ayah": "9",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Wahai orang-orang yang beriman, apabila diseru untuk salat pada hari Jumat, maka bersegeralah mengingat Allah dan tinggalkanlah jual beli.",
            "ms": "Wahai orang-orang yang beriman, apabila diseru untuk solat pada hari Jumaat, maka bersegeralah mengingati Allah dan tinggalkanlah jual beli.",
            "surahInd": "Al-Jumu'ah",
            "surahMs": "Al-Jumu'ah",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 82,
            "type": "quran",
            "en": "O you who have wrapped yourself, arise and stand in prayer at night, except for a little.",
            "tr": "Ey örtüsüne bürünen! Gecenin birazı hariç, kalk ve namaz kıl.",
            "surahEn": "Al-Muzzammil",
            "surahTr": "Müzzemmil",
            "ayah": "1-2",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Wahai orang yang berselimut, bangunlah dan salatlah pada malam hari kecuali sedikit.",
            "ms": "Wahai orang yang berselimut, bangunlah dan solatlah pada waktu malam kecuali sedikit.",
            "surahInd": "Al-Muzzammil",
            "surahMs": "Al-Muzzammil",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 83,
            "type": "hadith",
            "en": "Our Lord descends every night to the lowest heaven when the last third of the night remains and says: Who is calling upon Me that I may answer?",
            "tr": "Rabbimiz her gece, gecenin son üçte biri kaldığında en yakın semaya iner ve buyurur: Kim Bana dua ediyor ki icabet edeyim?",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Bukhari & Muslim",
            "sourceTr": "Buhârî & Müslim",
            "ind": "Tuhan kita turun setiap malam ke langit dunia ketika sepertiga malam terakhir tersisa dan berfirman: Siapa yang berdoa kepada-Ku agar Aku kabulkan?",
            "ms": "Tuhan kita turun setiap malam ke langit dunia apabila tinggal sepertiga malam yang terakhir dan berfirman: Siapa yang berdoa kepada-Ku supaya Aku perkenankan?",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Bukhari & Muslim",
            "sourceMs": "Bukhari & Muslim"
        },
        {
            "id": 84,
            "type": "quran",
            "en": "Allah is the Light of the heavens and the earth.",
            "tr": "Allah, göklerin ve yerin nurudur.",
            "surahEn": "An-Nur",
            "surahTr": "Nûr",
            "ayah": "35",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Allah adalah cahaya langit dan bumi.",
            "ms": "Allah adalah cahaya langit dan bumi.",
            "surahInd": "An-Nur",
            "surahMs": "An-Nur",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 85,
            "type": "quran",
            "en": "And whoever does good equal to the weight of an atom will see it.",
            "tr": "Kim zerre kadar hayır yapmışsa onu görecektir.",
            "surahEn": "Az-Zalzalah",
            "surahTr": "Zilzâl",
            "ayah": "7",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan barangsiapa yang mengerjakan kebaikan seberat zarrah pun, niscaya dia akan melihatnya.",
            "ms": "Dan sesiapa yang mengerjakan kebaikan seberat zarrah pun, nescaya dia akan melihatnya.",
            "surahInd": "Az-Zalzalah",
            "surahMs": "Az-Zalzalah",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 86,
            "type": "quran",
            "en": "And those who strive for Us, We will surely guide them to Our ways. And indeed, Allah is with those who do good.",
            "tr": "Bizim uğrumuzda cihad edenleri elbette yollarımıza ileteceğiz. Şüphesiz Allah, iyilik yapanlarla beraberdir.",
            "surahEn": "Al-'Ankabut",
            "surahTr": "Ankebût",
            "ayah": "69",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan orang-orang yang berjihad di jalan Kami, sungguh Kami akan tunjukkan kepada mereka jalan-jalan Kami. Dan sesungguhnya Allah beserta orang-orang yang berbuat baik.",
            "ms": "Dan orang-orang yang berjihad di jalan Kami, sungguh Kami akan tunjukkan kepada mereka jalan-jalan Kami. Dan sesungguhnya Allah berserta orang-orang yang berbuat baik.",
            "surahInd": "Al-'Ankabut",
            "surahMs": "Al-'Ankabut",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 87,
            "type": "hadith",
            "en": "Hold on to night prayer, for it was the practice of the righteous before you, a means of nearness to your Lord, and an expiation for sins.",
            "tr": "Gece namazına devam edin. Çünkü o sizden önceki salihlerin âdetidir, Rabbinize yaklaştırıcıdır ve günahlara kefarettir.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Tirmidhi",
            "sourceTr": "Tirmizî",
            "ind": "Jagalah salat malam, karena itu adalah kebiasaan orang-orang saleh sebelum kamu, sarana mendekatkan diri kepada Tuhanmu, dan penghapus dosa.",
            "ms": "Jagalah solat malam, kerana ia adalah kebiasaan orang-orang soleh sebelum kamu, sarana mendekatkan diri kepada Tuhanmu, dan penghapus dosa.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Tirmidzi",
            "sourceMs": "Tirmizi"
        },
        {
            "id": 88,
            "type": "quran",
            "en": "Say: My Lord would not care for you were it not for your supplication.",
            "tr": "De ki: Duanız olmasaydı Rabbim size ne diye değer versin?",
            "surahEn": "Al-Furqan",
            "surahTr": "Furkân",
            "ayah": "77",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Katakanlah: Tuhanku tidak akan mempedulikan kamu seandainya bukan karena doamu.",
            "ms": "Katakanlah: Tuhanku tidak akan mempedulikan kamu seandainya bukan kerana doa kamu.",
            "surahInd": "Al-Furqan",
            "surahMs": "Al-Furqan",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 89,
            "type": "quran",
            "en": "And your Lord says: Call upon Me; I will respond to you. Indeed, those who disdain My worship will enter Hell humiliated.",
            "tr": "Rabbiniz dedi ki: Bana dua edin, size icabet edeyim. Bana kulluk etmeyi kibirlerine yediremeyenler zelil olarak cehenneme girecekler.",
            "surahEn": "Ghafir",
            "surahTr": "Mü'min",
            "ayah": "60",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan Tuhanmu berfirman: Berdoalah kepada-Ku, niscaya Aku kabulkan untukmu. Sesungguhnya orang-orang yang menyombongkan diri dari beribadah kepada-Ku akan masuk neraka dalam keadaan hina.",
            "ms": "Dan Tuhanmu berfirman: Berdoalah kepada-Ku, nescaya Aku perkenankan untukmu. Sesungguhnya orang-orang yang sombong daripada beribadat kepada-Ku akan masuk neraka dalam keadaan hina.",
            "surahInd": "Ghafir",
            "surahMs": "Ghafir",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 90,
            "type": "hadith",
            "en": "Take advantage of five before five: your youth before old age, your health before illness, your wealth before poverty, your free time before busyness, and your life before death.",
            "tr": "Beş şeyden önce beş şeyi ganimet bil: İhtiyarlığından önce gençliğini, hastalığından önce sağlığını, fakirliğinden önce zenginliğini, meşguliyetinden önce boş vaktini, ölümünden önce hayatını.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Al-Hakim",
            "sourceTr": "Hâkim",
            "ind": "Manfaatkanlah lima perkara sebelum lima perkara: mudamu sebelum tuamu, sehatmu sebelum sakitmu, kayamu sebelum miskinmu, waktu luangmu sebelum sibukmu, dan hidupmu sebelum matimu.",
            "ms": "Manfaatkanlah lima perkara sebelum lima perkara: mudamu sebelum tuamu, sihatmu sebelum sakitmu, kayamu sebelum miskinmu, waktu lapangmu sebelum sibukmu, dan hidupmu sebelum matimu.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Al-Hakim",
            "sourceMs": "Al-Hakim"
        },
        {
            "id": 91,
            "type": "quran",
            "en": "My mercy encompasses all things.",
            "tr": "Rahmetim her şeyi kuşatmıştır.",
            "surahEn": "Al-A'raf",
            "surahTr": "A'râf",
            "ayah": "156",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Rahmat-Ku meliputi segala sesuatu.",
            "ms": "Rahmat-Ku meliputi segala sesuatu.",
            "surahInd": "Al-A'raf",
            "surahMs": "Al-A'raf",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 92,
            "type": "quran",
            "en": "And whoever fears Allah, He will make for him a way out and provide for him from where he does not expect.",
            "tr": "Kim Allah'tan korkarsa, Allah ona bir çıkış yolu açar ve ummadığı yerden rızık verir.",
            "surahEn": "At-Talaq",
            "surahTr": "Talâk",
            "ayah": "2-3",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan barangsiapa yang bertakwa kepada Allah, niscaya Dia akan membukakan jalan keluar baginya dan memberinya rezeki dari arah yang tidak disangka-sangka.",
            "ms": "Dan sesiapa yang bertakwa kepada Allah, nescaya Dia akan membukakan jalan keluar baginya dan memberinya rezeki dari arah yang tidak disangka-sangka.",
            "surahInd": "At-Talaq",
            "surahMs": "At-Talaq",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 93,
            "type": "hadith",
            "en": "Whoever Allah wants good for, He gives him understanding of the religion.",
            "tr": "Allah kime hayır dilerse onu dinde fakih kılar.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Bukhari & Muslim",
            "sourceTr": "Buhârî & Müslim",
            "ind": "Barangsiapa yang dikehendaki Allah kebaikan baginya, Dia memberikan kepadanya pemahaman dalam agama.",
            "ms": "Sesiapa yang dikehendaki Allah kebaikan baginya, Dia memberikan kepadanya kefahaman dalam agama.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Bukhari & Muslim",
            "sourceMs": "Bukhari & Muslim"
        },
        {
            "id": 94,
            "type": "quran",
            "en": "Indeed, Allah will not change the condition of a people until they change what is in themselves.",
            "tr": "Bir kavim kendi durumunu değiştirmedikçe Allah onların durumunu değiştirmez.",
            "surahEn": "Ar-Ra'd",
            "surahTr": "Ra'd",
            "ayah": "11",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sesungguhnya Allah tidak akan mengubah keadaan suatu kaum sebelum mereka mengubah keadaan diri mereka sendiri.",
            "ms": "Sesungguhnya Allah tidak akan mengubah keadaan sesuatu kaum sebelum mereka mengubah keadaan diri mereka sendiri.",
            "surahInd": "Ar-Ra'd",
            "surahMs": "Ar-Ra'd",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 95,
            "type": "quran",
            "en": "And He found you lost and guided you.",
            "tr": "Seni şaşırmış bulup yola iletti.",
            "surahEn": "Ad-Duhaa",
            "surahTr": "Duhâ",
            "ayah": "7",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan Dia mendapatimu tersesat, lalu Dia memberimu petunjuk.",
            "ms": "Dan Dia mendapatimu tersesat, lalu Dia memberimu petunjuk.",
            "surahInd": "Ad-Duhaa",
            "surahMs": "Ad-Duhaa",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 96,
            "type": "quran",
            "en": "So which of the favors of your Lord would you deny?",
            "tr": "Öyleyse Rabbinizin hangi nimetlerini yalanlarsınız?",
            "surahEn": "Ar-Rahman",
            "surahTr": "Rahmân",
            "ayah": "13",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
            "ms": "Maka nikmat Tuhanmu yang manakah yang kamu dustakan?",
            "surahInd": "Ar-Rahman",
            "surahMs": "Ar-Rahman",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 97,
            "type": "hadith",
            "en": "Be in this world as if you were a stranger or a traveler.",
            "tr": "Dünyada bir garip veya bir yolcu gibi ol.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Sahih Bukhari",
            "sourceTr": "Buhârî",
            "ind": "Jadilah di dunia ini seolah-olah kamu orang asing atau musafir.",
            "ms": "Jadilah di dunia ini seolah-olah kamu orang asing atau musafir.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Shahih Bukhari",
            "sourceMs": "Sahih Bukhari"
        },
        {
            "id": 98,
            "type": "quran",
            "en": "Indeed, We have granted you the Abundance. So pray to your Lord and sacrifice.",
            "tr": "Şüphesiz Biz sana Kevser'i verdik. Öyleyse Rabbin için namaz kıl ve kurban kes.",
            "surahEn": "Al-Kawthar",
            "surahTr": "Kevser",
            "ayah": "1-2",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Sesungguhnya Kami telah memberimu nikmat yang banyak. Maka dirikanlah salat karena Tuhanmu dan berkurbanlah.",
            "ms": "Sesungguhnya Kami telah memberimu nikmat yang banyak. Maka dirikanlah solat kerana Tuhanmu dan berkurbanlah.",
            "surahInd": "Al-Kautsar",
            "surahMs": "Al-Kautsar",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 99,
            "type": "quran",
            "en": "And We have already created man and know what his soul whispers to him, and We are closer to him than his jugular vein.",
            "tr": "Andolsun insanı Biz yarattık ve nefsinin ona ne fısıldadığını biliriz. Biz ona şah damarından daha yakınız.",
            "surahEn": "Qaf",
            "surahTr": "Kâf",
            "ayah": "16",
            "sourceEn": null,
            "sourceTr": null,
            "ind": "Dan sungguh Kami telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh jiwanya, dan Kami lebih dekat kepadanya daripada urat lehernya.",
            "ms": "Dan sungguh Kami telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh jiwanya, dan Kami lebih dekat kepadanya daripada urat lehernya.",
            "surahInd": "Qaf",
            "surahMs": "Qaf",
            "sourceInd": null,
            "sourceMs": null
        },
        {
            "id": 100,
            "type": "hadith",
            "en": "The strong believer is better and more beloved to Allah than the weak believer, but there is good in both. Strive for what benefits you and seek help from Allah.",
            "tr": "Kuvvetli mümin, zayıf müminden daha hayırlı ve Allah'a daha sevimlidir. Her birinde hayır vardır. Sana fayda verecek şeye gayret et ve Allah'tan yardım iste.",
            "surahEn": null,
            "surahTr": null,
            "ayah": null,
            "sourceEn": "Sahih Muslim",
            "sourceTr": "Müslim",
            "ind": "Mukmin yang kuat lebih baik dan lebih dicintai Allah daripada mukmin yang lemah, namun pada keduanya ada kebaikan. Bersungguh-sungguhlah pada apa yang bermanfaat bagimu dan mintalah pertolongan kepada Allah.",
            "ms": "Mukmin yang kuat lebih baik dan lebih dicintai Allah daripada mukmin yang lemah, namun pada kedua-duanya ada kebaikan. Bersungguh-sungguhlah pada apa yang bermanfaat bagimu dan mintalah pertolongan kepada Allah.",
            "surahInd": null,
            "surahMs": null,
            "sourceInd": "Shahih Muslim",
            "sourceMs": "Sahih Muslim"
        }
    ]
}
